public class Main {
    public static void main(String[] args) {

        // Задача 1

        int age = 15;
        if(age >= 18){
            System.out.println("Поздравляем! Вам 18 или больше!");
            if(age < 18){
                System.out.println(" Вам еще нет 18, нужно немного подождать.");
            }
        }
    }
}